app/code/Kensium/Amconnector/etc/amconnector/TimeZone.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <soap:Body>
        <Get xmlns="http://www.acumatica.com/entity/5.30.001/AmconnectorConfig/">
            <entity xsi:type="TimeZone">
                <ID xsi:nil="true"/>
                <Delete>false</Delete>
                <ServerTime xsi:nil="true"/>
                <TimeZone xsi:nil="true"/>
                <Login>
                    <Value>USERNAMEVALUE</Value>
                    <HasError>false</HasError>
                </Login>
            </entity>
        </Get>
    </soap:Body>
</soap:Envelope>
